app/views/posts/show.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 11]]
---
<p>Posted by: <%= @post.user.email %></p>
<p><%= @post.likes.count %> Likes</p>