app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "hola"], ["user_id", 1], ["post_id", 11], ["created_at", "2023-07-11 02:46:12.549800"], ["updated_at", "2023-07-11 02:46:12.549800"]]
---
  def create
    @comment = @post.comments.build(comment_params)
    @comment.user = current_user

    if @comment.save